In [1]:
import pandas as pd
df=pd.read_csv("C:/3-Statistics\IPL-IMB381IPL2013.csv")
df.head()

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,1,"Abdulla, YA",2,SA,KXIP,Allrounder,0,0,0,0.00,...,0.00,0,307,15,20.47,8.90,13.93,2009,50000,50000
1,2,Abdur Razzak,2,BAN,RCB,Bowler,214,18,657,71.41,...,0.00,0,29,0,0.00,14.50,0.00,2008,50000,50000
2,3,"Agarkar, AB",2,IND,KKR,Bowler,571,58,1269,80.62,...,121.01,5,1059,29,36.52,8.81,24.90,2008,200000,350000
3,4,"Ashwin, R",1,IND,CSK,Bowler,284,31,241,84.56,...,76.32,0,1125,49,22.96,6.23,22.14,2011,100000,850000
4,5,"Badrinath, S",2,IND,CSK,Batsman,63,0,79,45.93,...,120.71,28,0,0,0.00,0.00,0.00,2011,100000,800000

In [2]:
df.iloc[:5,7:]
#nominal,quantitave data-discrete data,nominal,nominal,conginuous

,T-WKTS,ODI-RUNS-S,ODI-SR-B,ODI-WKTS,ODI-SR-BL,CAPTAINCY EXP,RUNS-S,HS,AVE,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,0,0,0.00,0,0.0,0,0,0,0.00,0.00,0,307,15,20.47,8.90,13.93,2009,50000,50000
1,18,657,71.41,185,37.6,0,0,0,0.00,0.00,0,29,0,0.00,14.50,0.00,2008,50000,50000
2,58,1269,80.62,288,32.9,0,167,39,18.56,121.01,5,1059,29,36.52,8.81,24.90,2008,200000,350000
3,31,241,84.56,51,36.8,0,58,11,5.80,76.32,0,1125,49,22.96,6.23,22.14,2011,100000,850000
4,0,79,45.93,0,0.0,0,1317,71,32.93,120.71,28,0,0,0.00,0.00,0.00,2011,100000,800000

In [3]:
set(df['AGE'])

{1, 2, 3}

In [4]:
set(df['T-RUNS'])

{0,
 5,
 11,
 13,
 16,
 17,
 51,
 54,
 58,
 60,
 63,
 70,
 74,
 77,
 83,
 88,
 107,
 116,
 120,
 141,
 146,
 149,
 199,
 214,
 249,
 275,
 281,
 284,
 288,
 320,
 380,
 392,
 432,
 483,
 491,
 503,
 537,
 541,
 544,
 555,
 556,
 571,
 624,
 641,
 654,
 683,
 699,
 710,
 770,
 1000,
 1105,
 1114,
 1219,
 1261,
 1269,
 1451,
 1462,
 1546,
 1586,
 1606,
 1716,
 1775,
 1780,
 1944,
 2164,
 2173,
 2200,
 2506,
 2648,
 2742,
 3089,
 3154,
 3509,
 3712,
 3763,
 3781,
 3845,
 4188,
 4486,
 4722,
 5457,
 5515,
 5570,
 5708,
 5842,
 6167,
 6373,
 6398,
 6654,
 6973,
 7172,
 7212,
 8042,
 8178,
 8625,
 8781,
 9382,
 9918,
 10440,
 12379,
 13218,
 13288,
 15470}

In [5]:
df.iloc[:5,7:14]
#CAPTAINCY EXP-discrete
#REST ALl-continuous

   T-WKTS  ODI-RUNS-S  ODI-SR-B  ODI-WKTS  ODI-SR-BL  CAPTAINCY EXP  RUNS-S
0       0           0      0.00         0        0.0              0       0
1      18         657     71.41       185       37.6              0       0
2      58        1269     80.62       288       32.9              0     167
3      31         241     84.56        51       36.8              0      58
4       0          79     45.93         0        0.0              0    1317

In [6]:
df.iloc[:5,14:21]#continuous

   HS    AVE    SR-B  SIXERS  RUNS-C  WKTS  AVE-BL
0   0   0.00    0.00       0     307    15   20.47
1   0   0.00    0.00       0      29     0    0.00
2  39  18.56  121.01       5    1059    29   36.52
3  11   5.80   76.32       0    1125    49   22.96
4  71  32.93  120.71      28       0     0    0.00

In [20]:
import pandas as pd
import numpy as np

In [21]:
df=pd.read_csv("C:/3-Statistics\income.csv",names=["name","income"],skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [9]:
df.income.describe()

count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07
Name: income, dtype: float64

In [10]:
df.income.quantile(0)

4000.0

In [11]:
df.income.quantile(0.25,interpolation='higher')

6000

In [12]:
df.income.quantile(1)

10000000.0

In [13]:
percentile_99=df.income.quantile(0.99)
percentile_99

9400479.999999994

In [22]:
df_no_outlier=df.income.quantile(0.99)
df_no_outlier

9400479.999999994

In [23]:
df['income'][3]=np.NaN

C:\Users\Hp\AppData\Local\Temp\ipykernel_15972\3054271026.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.NaN

In [16]:
df.income.mean()

1671666.6666666667

In [17]:
df.income.max()

10000000.0

In [18]:
df.income.min()

4000.0

In [19]:
df_new=df.fillna(df.income.mean())
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07